{
  "_name_or_path": "dangkhoadl/AudioResNet",
  "architectures": [
    "ResNetForAudioClassification"
  ],
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2,
    "LABEL_3": 3
  },
  "model_type": "resnet",
  "resnet_arch": "resnet_152",
  "torch_dtype": "float32",
  "transformers_version": "4.30.2"
}
